# R002: 주석
# 정원혁, 2014

#####
# 실행
# 소스 파일을 실행할 때는 Ctrl + 엔터
# 콘솔 화면에서 실행할 때는 엔터
# 범위를 잡고 한꺼번에 실행해도 된다.

# 주석 ----------------------------------------------------------------------

# 은 주석이다.
# 단축키로 Shfit +Ctrl + C 를 눌러도 된다.
# 을 다섯개 연속으로 누르면 section 으로 인식된다. 

# 다음 코드를 주석처리 해보고, 다시 주석 제거를 해 보자.

x <- 1:10
x

y <- 100:110
y


# 타이핑 꿀 팁! ----------------------------------------------------------------
# <- 타이핑 하기 아주 어렵다.
# Alt 와 - 를 눌러보자.
# Jupyter Notebook도 가능하다.
# Google Colab에서는 안된다.
# 정 어렵다면 = 을 써도 되지만, 아주 간혹 문제가 생긴다고 한다. 


# 섹션 ----------------------------------------------------------------------

# Shift + Ctrl + R 을 누르면 section이 생성된다. 메뉴의 Code / Insert Section 
# section 앞에 있는 작은 화살표를 누르면 해당 섹션을 모두 접거나 펼칠 수 있다.
# Alt + O (영문)를 누르면 모든 섹션을 접는다.
# Shift + Alt + O (영문) 를 누르면 모든 섹션이 펼쳐진다.
# Alt + L을 누르면 해당 섹션만 접는다.



# 문서 구조 -------------------------------------------------------------------
# Shift + Ctrl + O를 누르면 문서 구조를 볼 수 있다.
# 코드를 짤 때 전체 구조를 먼저 섹션으로 만들고 작성하기를 권장한다. 
# templateR.R을 참고 

# 도움말 단축키  ----------------------------------------------------------------
# Shift + Alt + K 를 누르면 키보드 단축키 도움말이 나온다.
