# 정원혁 2014 R

# getwd/ setwd -------------------------------------------------------------------
# 현재의 폴더 working folder를 확인하세요

# setwd 로 원하는 위치에서 파일이 처리 되도록 설정하세요

# CSV 파일 읽기 ---------------------------------------------------------------
# 적어도 3컬럼, 6행을 가진 엑셀 파일을 만들어 csv 혹은 tsv 형식으로 저장하세요
# read.csv 로 파일 내용을 읽어오세요.
# 읽어 온 내용을 콘솔에 출력하세요.

# read.table 로 같은 파일 내용을 읽어오세요.
# 읽어 온 내용을 콘솔에 출력하세요.


# 인터넷에서 직접 읽어오기 (아래 다양한 방법 중 선택) ------------------------------------------
# 'https://raw.githubusercontent.com/plotly/datasets/master/1962_2006_walmart_store_openings.csv' 의 파일을 직접 읽어와서 dat 라는 변수에 저장하세요
# dat의 내용을 콘솔에 출력하세요summary로 읽어온 자료의 내용을 요약하세요
# str, head, tail로 dat 내용의 일 부분을 콘솔에 출력하세요


# csv로 저장하기 ---------------------------------------------------------------


# 제대로 저장되었는지 파일을 찾아 확인하세요.


# pdf 로 결과 저장 하기 ----------------------------------------------------------
dat  <- rnorm(30)
# dat 의 histogram 을 pdf 에 출력하세요
